[
  {
    "title": "REST Countries API with color theme switcher",
    "description": [
      "User is able to toggle between light & dark mode.",
      "Users is able to filter view by regions.",
      "Users are able to search by countries ",
      "Users are able to view countries details and also have access to border countries for the country viewed."
    ],
    "imagePath": "/rest-countries.png",
    "stack": ["Nextjs", "JavaScript", "Tailwind", "API"],
    "github": "https://github.com/mercyharbo/frontendmentor-projects/tree/rest-countries-app",
    "liveSite": "https://rest-countriessapp.netlify.app/"
  },
  {
    "title": "Unsplash Clone",
    "description": [
      "Users can also fetch photos by category selected and the hero header image change based on category selected.",
      "Users can also search for photos by name.",
      "Users have ability to load more photos by triggering the load more button",
      "Users have ability to view photo details, which also gives users the ability to view related collection photos and tags too",
      "Added overlay features to the images which includes details of the photo owners, and buttons to save, like, and download."
    ],
    "imagePath": "/unsplash.png",
    "stack": ["CSS", "JavaScript", "Next.js", "Tailwind", "API", "Redux toolkit"],
    "github": "https://github.com/mercyharbo/frontendmentor-projects/tree/unsplash",
    "liveSite": "https://mercyunsplashphotos.netlify.app/"
  },
  {
    "title": "Code With Mercy | Portfolio website",
    "description": [
      "I added features that loads my blog posts from Hashnode and access to read brief of the content before linking to Hashnode the full post.",
      "I used Formspree for form sunmission for visitors that want to contact me by email through my portfolio instead of having to open that mailing app.",
      "I also make use of framer motion for animation and page transition on my portfolio pages so visitors don't have that boring navigation."
    ],
    "imagePath": "/portfolio.png",
    "stack": ["Next.js", "Tailwind", "API", "react-icons"],
    "github": "https://github.com/portfolio",
    "liveSite": "https://codewithmercy.netlify.app"
  }
]